vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <condition id="anyOf.driver.lpuart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="device.MCXE315.internal_condition">
      <accept Dname="MCXE315MLF" Dvendor="NXP:11"/>
      <accept Dname="MCXE315MPA" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MCXE316.internal_condition">
      <accept Dname="MCXE316MLF" Dvendor="NXP:11"/>
      <accept Dname="MCXE316MPA" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.MCXE317.internal_condition">
      <accept Dname="MCXE317MPA" Dvendor="NXP:11"/>
      <accept Dname="MCXE317MPB" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.mcux-edgelock.ele_hseb.condition_id">
      <require condition="allOf.board=frdmmcxe31b, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.board=frdmmcxe31b, device=MCXE31B.internal_condition">
      <require condition="board.frdmmcxe31b.internal_condition"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="board.frdmmcxe31b.internal_condition">
      <accept condition="device.MCXE31B.internal_condition"/>
      <accept condition="device.MCXE315.internal_condition"/>
      <accept condition="device.MCXE316.internal_condition"/>
      <accept condition="device.MCXE317.internal_condition"/>
    </condition>
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, driver.qspi, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, driver.qspi, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7, driver.qspi.internal_condition"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.qspi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="qspi"/>
    </condition>
    <condition id="component.mflash_onchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, driver.flash_c40, driver.mcm, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, driver.flash_c40, driver.mcm, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7, driver.flash_c40, driver.mcm.internal_condition"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.flash_c40, driver.mcm.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="flash_c40"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mcm"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phyaqr113c.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.component.eth_phy_common, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phyar8031.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phydp8384x.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phygpy215.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phyksz8041.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phyksz8081.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phylan8720a.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phylan8741.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8201.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phyrtl8211f.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phytja1100.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phytja1120.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phyvsc8541.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.phyyt8521.condition_id">
      <require condition="allOf.component.eth_phy_common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.pit_adapter.condition_id">
      <require condition="allOf.driver.pit, device=MCXE31B.internal_condition"/>
    </condition>
