vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <condition id="allOf.driver.pit, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=component.software_rng_adapter, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.software_rng_adapter, device=MCXE31B.internal_condition">
      <require condition="anyOf.component.software_rng_adapter.internal_condition"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="anyOf.component.software_rng_adapter.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.serial_manager.condition_id">
      <require condition="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MCXE31B.internal_condition">
      <require condition="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="anyOf.component.serial_manager_spi, component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_spi"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_swo"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <accept Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_virtual"/>
    </condition>
    <condition id="component.serial_manager_spi.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpspi_adapter, driver.lpspi, device=MCXE31B.internal_condition">
      <require condition="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpspi_adapter, driver.lpspi.internal_condition">
      <accept condition="allOf.component.lpspi_adapter, driver.lpspi.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpspi_adapter, driver.lpspi.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
    </condition>
    <condition id="component.serial_manager_swo.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_uart.condition_id">
      <require condition="allOf.component.lpuart_adapter, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpuart_adapter, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.serial_manager_virtual.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.sgtl_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="device_id.MCXE31B.internal_condition">
      <accept Dname="MCXE31BMPB" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.silicon_id.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=device_id=MCXE31B, component.silicon_id_mcxe31x, driver.common.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=device_id=MCXE31B, component.silicon_id_mcxe31x, driver.common.internal_condition">
      <require condition="anyOf.allOf=anyOf=device_id=MCXE31B, component.silicon_id_mcxe31x.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=device_id=MCXE31B, component.silicon_id_mcxe31x.internal_condition">
      <accept condition="allOf.anyOf=device_id=MCXE31B, component.silicon_id_mcxe31x.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXE31B, component.silicon_id_mcxe31x.internal_condition">
      <require condition="anyOf.device_id=MCXE31B.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="silicon_id_mcxe31x"/>
    </condition>
    <condition id="anyOf.device_id=MCXE31B.internal_condition">
      <accept condition="device_id.MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imx8.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imx93.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt10xx.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
