vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <condition id="component.silicon_id_imxrt1170.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_imxrt1180.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxe31x.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_mcxn.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_rw610.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.silicon_id_scfw.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.software_crc_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.tfa9896_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.tfa9xxx_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.pit_adapter, driver.pit, component.lists, driver.common, device=MCXE31B.internal_condition">
      <require condition="anyOf.allOf=component.pit_adapter, driver.pit.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.pit_adapter, driver.pit.internal_condition">
      <accept condition="allOf.component.pit_adapter, driver.pit.internal_condition"/>
    </condition>
    <condition id="allOf.component.pit_adapter, driver.pit.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pit"/>
    </condition>
    <condition id="component.wm8524_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.wm8904_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.wm8960_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="component.wm8962_adapter.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=MCXE31B.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="device.MCXE31B_flash.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXE31B.internal_condition">
      <require condition="device_id.MCXE31B.internal_condition"/>
    </condition>
    <condition id="device_ids.MCXE31B.internal_condition">
      <accept Dname="MCXE31BMPB" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=MCXE31B.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.MCXE31B.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=MCXE31B.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.MCXE31B.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=MCXE31B.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.MCXE31B.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.device_id=MCXE31B, driver.common, driver.siul2, driver.clock, driver.memory, component.lpuart_adapter, CMSIS_Include_core_cm, device.CMSIS, device.system, device.startup, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
