vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <condition id="allOf.device_id=MCXE31B, driver.common, driver.siul2, driver.clock, driver.memory, component.lpuart_adapter, CMSIS_Include_core_cm, device.CMSIS, device.system, device.startup, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require condition="device_id.MCXE31B.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="Siul2"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="memory"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE31B_header"/>
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE31B_system"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require condition="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition">
      <accept condition="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition"/>
      <accept condition="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug console template config"/>
    </condition>
    <condition id="allOf.utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE31B_system"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, iar, mdk.condition_id">
      <require condition="toolchains.armgcc, iar, mdk.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, iar, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="IAR"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="MCXE31B_header"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.bctu.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.cache_armv7_m7.condition_id">
      <require condition="allOf.driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.camera-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.video-common, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-common"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ap1302.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.video-i2c, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-device-common, driver.video-i2c, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-common.condition_id">
      <require condition="allOf.driver.camera-common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-common, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-max9286.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.video-i2c, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-mt9m114.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.video-i2c, device=MCXE31B.internal_condition"/>
    </condition>
