vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <condition id="driver.camera-device-ov5640.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-sccb"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7670.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-ov7725.condition_id">
      <require condition="allOf.driver.camera-device-common, driver.camera-device-sccb, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.camera-device-sccb.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpi2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="driver.camera-receiver-common.condition_id">
      <require condition="allOf.driver.camera-common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpi2c.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXE31B, device.RTE, device_id=MCXE31B, driver.lpi2c_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, anyOf=allOf=driver.lpi2c, device_id=MCXE31B, device.RTE, device_id=MCXE31B, driver.lpi2c_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpi2c, device_id=MCXE31B.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpi2c, device_id=MCXE31B.internal_condition">
      <accept condition="allOf.driver.lpi2c, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpi2c, device_id=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpspi.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXE31B, device.RTE, device_id=MCXE31B, driver.lpspi_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MCXE31B, device.RTE, device_id=MCXE31B, driver.lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpspi, device_id=MCXE31B.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpspi, device_id=MCXE31B.internal_condition">
      <accept condition="allOf.driver.lpspi, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device_id=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXE31B, device.RTE, device_id=MCXE31B, driver.lpuart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MCXE31B, device.RTE, device_id=MCXE31B, driver.lpuart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpuart, device_id=MCXE31B.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpuart, device_id=MCXE31B.internal_condition">
      <accept condition="allOf.driver.lpuart, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart, device_id=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.cmu_fc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.cmu_fm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.codec.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm7f.condition_id">
      <require condition="cores.cm7f.internal_condition"/>
    </condition>
    <condition id="cores.cm7f.internal_condition">
      <accept Dcore="Cortex-M7"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
