vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <condition id="driver.dbi.condition_id">
      <require condition="allOf.driver.video-common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.dbi_flexio_edma.condition_id">
      <require condition="allOf.driver.edma4, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma4, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-dbi.condition_id">
      <require condition="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dbi, driver.dc-fb-common, driver.display-common, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.dc-fb-ssd1963.condition_id">
      <require condition="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dc-fb-common, driver.display-common, driver.ssd1963, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dc-fb-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.dcm.condition_id">
      <require condition="allOf.driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.dcm_gpr.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.display-adv7535.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.display-common, driver.video-i2c, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="display-common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.display-common.condition_id">
      <require condition="allOf.driver.video-common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.display-it6161.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.display-it6263.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.display-sn65dsi83.condition_id">
      <require condition="allOf.driver.display-common, driver.video-i2c, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.eMIOS.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.edma4.condition_id">
      <require condition="allOf.driver.edma_soc, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.edma_soc, device_id=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma_soc"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.edma_soc.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.ektf2k.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.enet_qos.condition_id">
      <require condition="allOf.driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.flash_c40.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.flexcan.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.flexcan_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexcan, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexcan, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexcan"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.edma4.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
    </condition>
