vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <condition id="driver.flexio_mculcd.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.flexio_mculcd_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_mculcd, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_mculcd, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_mculcd"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_spi, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_spi, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.flexio_uart, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.flexio_uart, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.ft3267.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.ft5406.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.ft5406_rt.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.ft6x06.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.I2C, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.I2C, device=MCXE31B.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.4.0"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.intm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.lcu.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.lpcmp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.lpi2c, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.lpi2c, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.lpspi, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.lpspi, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.lpuart, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.lpuart, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
