vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.mc_rgm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.mcm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.memory.condition_id">
      <require condition="allOf.driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.pca9420.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, driver.power, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, driver.common, driver.power, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.pca9422.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, driver.power, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.pf1550.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.pf3000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.pf5020.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.pit.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.power.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.qspi.condition_id">
      <require condition="allOf.anyOf=allOf=device_id=MCXE31B, driver.qspi_mcxe31b, driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=device_id=MCXE31B, driver.qspi_mcxe31b, driver.common, device_id=MCXE31B.internal_condition">
      <require condition="anyOf.allOf=device_id=MCXE31B, driver.qspi_mcxe31b.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXE31B.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=device_id=MCXE31B, driver.qspi_mcxe31b.internal_condition">
      <accept condition="allOf.device_id=MCXE31B, driver.qspi_mcxe31b.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=MCXE31B, driver.qspi_mcxe31b.internal_condition">
      <require condition="device_id.MCXE31B.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="qspi_mcxe31b"/>
    </condition>
    <condition id="driver.qspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma4, driver.qspi, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma4, driver.qspi, device=MCXE31B.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="qspi"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.qspi_mcxe31b.condition_id">
      <require condition="allOf.device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.rtc_jdp.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.sar_adc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.siul2.condition_id">
      <require condition="allOf.device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.ssd1963.condition_id">
      <require condition="allOf.driver.dbi, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, device=MCXE31B.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require condition="device.MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.st7796s.condition_id">
      <require condition="allOf.driver.dbi, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.stm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.swt.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.tempsense.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.tma525b.condition_id">
      <require condition="allOf.device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.trgmux.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.tspc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXE31B.internal_condition"/>
    </condition>
    <condition id="driver.video-common.condition_id">
      <require condition="allOf.driver.common, device=MCXE31B.internal_condition"/>
    </condition>
