vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <component Cclass="ele_hseb" Cgroup="ele_hseb" Cversion="1.0.0" condition="component.ele_hseb.condition_id">
      <description>Component ele_hseb</description>
      <files>
        <file category="doc" name="components/ele_hseb/component.ele_hseb_dummy.txt"/>
      </files>
    </component>
    <component Cclass="ele_hseb_framework" Cgroup="ele_hseb" Cversion="1.0.0" condition="component.ele_hseb_framework.condition_id">
      <description>Component ele_hseb_framework</description>
      <files>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_common_test.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_aead.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_aead.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_attrs.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_attrs.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_cipher.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_cipher.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_cmac_with_counter.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_cmac_with_counter.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_ecc.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_ecc.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_format_key_catalogs.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_format_key_catalogs.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_hash.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_hash.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_impex_stream.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_impex_stream.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_import_key.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_import_key.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_kdf.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_kdf.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_mac.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_mac.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_monotonic_counters.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_monotonic_counters.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_rng.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_rng.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_rsa_cipher.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_rsa_cipher.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_sign.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_sign.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_crypto_helper/hse_host_utils.c" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_crypto_helper/hse_host_utils.h" projectpath="component/ele_hseb/framework/host_crypto_helper"/>
        <file category="header" name="components/ele_hseb/framework/host_hse/host_compiler_api.h" projectpath="component/ele_hseb/framework/host_hse"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_hse/hse_host.c" projectpath="component/ele_hseb/framework/host_hse"/>
        <file category="header" name="components/ele_hseb/framework/host_hse/hse_host.h" projectpath="component/ele_hseb/framework/host_hse"/>
        <file category="header" name="components/ele_hseb/framework/host_hse/hse_tracing.h" projectpath="component/ele_hseb/framework/host_hse"/>
        <file category="header" name="components/ele_hseb/framework/host_hse/hse_b/hse_default_config.h" projectpath="component/ele_hseb/framework/host_hse/hse_b"/>
        <file category="sourceC" name="components/ele_hseb/framework/host_keymgmt/hse_keys_allocator.c" projectpath="component/ele_hseb/framework/host_keymgmt"/>
        <file category="header" name="components/ele_hseb/framework/host_keymgmt/hse_keys_allocator.h" projectpath="component/ele_hseb/framework/host_keymgmt"/>
        <file category="include" name="components/ele_hseb/"/>
        <file category="include" name="components/ele_hseb/framework/host_crypto_helper/"/>
        <file category="include" name="components/ele_hseb/framework/host_hse/"/>
        <file category="include" name="components/ele_hseb/framework/host_hse/hse_b/"/>
        <file category="include" name="components/ele_hseb/framework/host_keymgmt/"/>
      </files>
    </component>
