vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-common" Cversion="2.0.0" condition="component.eth_phy_common.condition_id">
      <description>Driver phy-common</description>
      <files>
        <file category="header" name="components/phy/fsl_phy.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flash_nor_lpspi" Cversion="1.0.0" condition="component.flash_nor_lpspi.condition_id">
      <description>Component flash_nor_lpspi</description>
      <files>
        <file category="header" name="components/flash/nor/fsl_nor_flash.h" projectpath="nor_flash/nor"/>
        <file category="sourceC" name="components/flash/nor/lpspi/fsl_lpspi_nor_flash.c" projectpath="nor_flash/nor/lpspi"/>
        <file category="header" name="components/flash/nor/lpspi/fsl_lpspi_nor_flash.h" projectpath="nor_flash/nor/lpspi"/>
        <file category="sourceC" name="components/flash/nor/lpspi/fsl_lpspi_mem_adapter.c" projectpath="nor_flash/nor/lpspi"/>
        <file category="header" name="components/flash/nor/lpspi/fsl_lpspi_mem_adapter.h" projectpath="nor_flash/nor/lpspi"/>
        <file category="include" name="components/flash/nor/"/>
        <file category="include" name="components/flash/nor/lpspi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lists" Cversion="1.0.0" condition="component.lists.condition_id">
      <description>Component lists</description>
      <files>
        <file category="header" name="components/lists/fsl_component_generic_list.h" projectpath="component/lists"/>
        <file category="sourceC" name="components/lists/fsl_component_generic_list.c" projectpath="component/lists"/>
        <file category="include" name="components/lists/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="log" Cversion="1.0.0" condition="component.log.condition_id">
      <description>Component log</description>
      <files>
        <file category="header" name="components/log/fsl_component_log.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log.c" projectpath="component/log"/>
        <file category="header" name="components/log/fsl_component_log_config.h" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="debugconsole" Cversion="1.0.0" condition="component.log.backend.debug_console.condition_id">
      <description>Component log backend debug console</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_debugconsole.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_debugconsole.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="debugconsole_lite" Cversion="1.0.0" condition="component.log.backend.debug_console_lite.condition_id">
      <description>Component log backend debug console lite</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_debugconsole.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_debugconsole.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ringbuffer" Cversion="1.0.0" condition="component.log.backend.ringbuffer.condition_id">
      <description>Component log backend ring buffer</description>
      <files>
        <file category="header" name="components/log/fsl_component_log_backend_ringbuffer.h" projectpath="component/log"/>
        <file category="sourceC" name="components/log/fsl_component_log_backend_ringbuffer.c" projectpath="component/log"/>
        <file category="include" name="components/log/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_adapter" Cversion="1.0.0" condition="component.lpspi_adapter.condition_id">
      <description>Component lpspi_adapter</description>
      <files>
        <file category="header" name="components/spi/fsl_adapter_spi.h" projectpath="component/spi"/>
        <file category="sourceC" name="components/spi/fsl_adapter_lpspi.c" projectpath="component/spi"/>
        <file category="include" name="components/spi/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter" Cversion="1.0.0" condition="component.lpuart_adapter.condition_id">
      <description>Component lpuart_adapter</description>
      <files>
        <file category="header" name="components/uart/fsl_adapter_uart.h" projectpath="component/uart"/>
        <file category="sourceC" name="components/uart/fsl_adapter_lpuart.c" projectpath="component/uart"/>
        <file category="include" name="components/uart/"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="ele_hseb" Cversion="1.0.0" condition="component.mcux-edgelock.ele_hseb.condition_id">
      <description>ELE HSEB Firmware</description>
      <files>
        <file category="other" name="firmware/edgelock/ELE_HSEB/MCXE315/HSE_FW/ABSwap/mcxe315_hse_fw_1.12.0_2.55.0_pb250324.bin.pink" projectpath="firmware/edgelock/ELE_HSEB/MCXE315/HSE_FW/ABSwap"/>
        <file category="other" name="firmware/edgelock/ELE_HSEB/MCXE315/HSE_FW/FullMem/mcxe315_hse_fw_0.12.0_2.55.0_pb250324.bin.pink" projectpath="firmware/edgelock/ELE_HSEB/MCXE315/HSE_FW/FullMem"/>
        <file category="other" name="firmware/edgelock/ELE_HSEB/MCXE316/HSE_FW/ABSwap/mcxe316_hse_fw_1.12.0_2.55.0_pb250324.bin.pink" projectpath="firmware/edgelock/ELE_HSEB/MCXE316/HSE_FW/ABSwap"/>
        <file category="other" name="firmware/edgelock/ELE_HSEB/MCXE316/HSE_FW/FullMem/mcxe316_hse_fw_0.12.0_2.55.0_pb250324.bin.pink" projectpath="firmware/edgelock/ELE_HSEB/MCXE316/HSE_FW/FullMem"/>
        <file category="other" name="firmware/edgelock/ELE_HSEB/MCXE317/HSE_FW/ABSwap/mcxe317_hse_fw_1.13.0_2.55.0_pb250324.bin.pink" projectpath="firmware/edgelock/ELE_HSEB/MCXE317/HSE_FW/ABSwap"/>
        <file category="other" name="firmware/edgelock/ELE_HSEB/MCXE317/HSE_FW/FullMem/mcxe317_hse_fw_0.13.0_2.55.0_pb250324.bin.pink" projectpath="firmware/edgelock/ELE_HSEB/MCXE317/HSE_FW/FullMem"/>
        <file category="other" name="firmware/edgelock/ELE_HSEB/MCXE3xB/HSE_FW/ABSwap/mcxe3xb_hse_fw_1.5.0_2.55.0_pb250324.bin.pink" projectpath="firmware/edgelock/ELE_HSEB/MCXE3xB/HSE_FW/ABSwap"/>
        <file category="other" name="firmware/edgelock/ELE_HSEB/MCXE3xB/HSE_FW/FullMem/mcxe3xb_hse_fw_0.5.0_2.55.0_pb250324.bin.pink" projectpath="firmware/edgelock/ELE_HSEB/MCXE3xB/HSE_FW/FullMem"/>
        <file category="doc" name="firmware/edgelock/ELE_HSEB/README.md" projectpath="firmware/edgelock/ELE_HSEB"/>
        <file category="include" name="firmware/edgelock/ELE_HSEB/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_offchip" Cversion="1.0.0" condition="component.mflash_offchip.condition_id">
      <description>mflash offchip</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_offchip_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip" Cversion="1.0.0" condition="component.mflash_onchip.condition_id">
      <description>mflash onchip</description>
      <RTE_Components_h>
#ifndef MFLASH_FILE_BASEADDR
#define MFLASH_FILE_BASEADDR 1048576
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/flash/mflash/mflash_common.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mflash_file.c" projectpath="flash/mflash"/>
        <file category="header" name="components/flash/mflash/mflash_file.h" projectpath="flash/mflash"/>
        <file category="sourceC" name="components/flash/mflash/mcxe3x/mflash_drv.c" projectpath="flash/mflash/mcxe3x"/>
        <file category="header" name="components/flash/mflash/mcxe3x/mflash_drv.h" projectpath="flash/mflash/mcxe3x"/>
        <file category="include" name="components/flash/mflash/"/>
        <file category="include" name="components/flash/mflash/mcxe3x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="mflash_onchip_fmu" Cversion="1.0.0" condition="component.mflash_onchip_fmu.condition_id">
      <description>mflash onchip_fmu</description>
      <files>
        <file category="doc" name="components/flash/mflash/component.mflash_onchip_fmu_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="panic" Cversion="1.0.0" condition="component.panic.condition_id">
      <description>Component panic</description>
      <files>
        <file category="header" name="components/panic/fsl_component_panic.h" projectpath="component/panic"/>
        <file category="sourceC" name="components/panic/fsl_component_panic.c" projectpath="component/panic"/>
        <file category="include" name="components/panic/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x_adapter" Cversion="2.0.0" condition="component.pcm186x_adapter.condition_id">
      <description>Component pcm186x adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/pcm186x/fsl_codec_pcm186x_adapter.h" projectpath="codec/port/pcm186x"/>
        <file category="sourceC" name="components/codec/port/pcm186x/fsl_codec_pcm186x_adapter.c" projectpath="codec/port/pcm186x"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/pcm186x/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x_adapter" Cversion="2.0.0" condition="component.pcm512x_adapter.condition_id">
      <description>Component pcm512x adapter for single codec</description>
      <files>
        <file category="header" name="components/codec/port/pcm512x/fsl_codec_pcm512x_adapter.h" projectpath="codec/port/pcm512x"/>
        <file category="sourceC" name="components/codec/port/pcm512x/fsl_codec_pcm512x_adapter.c" projectpath="codec/port/pcm512x"/>
        <file category="header" name="components/codec/port/fsl_codec_adapter.h" projectpath="codec/port"/>
        <file category="include" name="components/codec/port/pcm512x/"/>
        <file category="include" name="components/codec/port/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="phy-device-aqr113c" Cversion="2.0.0" condition="component.phyaqr113c.condition_id">
      <description>Driver phy-device-aqr113c</description>
      <files>
        <file category="sourceC" name="components/phy/device/phyaqr113c/fsl_phyaqr113c.c" projectpath="component/phy"/>
        <file category="header" name="components/phy/device/phyaqr113c/fsl_phyaqr113c.h" projectpath="component/phy"/>
        <file category="include" name="components/phy/device/phyaqr113c/"/>
      </files>
    </component>
