vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qspi" Cversion="2.3.1" condition="driver.qspi.condition_id">
      <description>QSPI Driver</description>
      <files>
        <file category="header" name="devices/MCXE31B/drivers/fsl_qspi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_qspi.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qspi_edma" Cversion="2.2.4" condition="driver.qspi_edma.condition_id">
      <description>QSPI Driver</description>
      <files>
        <file category="header" name="devices/MCXE31B/drivers/fsl_qspi_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_qspi_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qspi_mcxe31b" Cversion="2.0.0" condition="driver.qspi_mcxe31b.condition_id">
      <description>QSPI mcxe31b Soc Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_qspi_soc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE31B/drivers/fsl_qspi_soc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtc_jdp" Cversion="2.0.0" condition="driver.rtc_jdp.condition_id">
      <description>RTC JDP Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_rtc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE31B/drivers/fsl_rtc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt" Cversion="7.22.0" condition="driver.rtt.condition_id">
      <description>SEGGER Real Time Transfer(RTT)</description>
      <files>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT.c" projectpath="rtt/RTT"/>
        <file category="header" name="components/rtt/RTT/SEGGER_RTT.h" projectpath="rtt/RTT"/>
        <file category="sourceAsm" name="components/rtt/RTT/SEGGER_RTT_ASM_ARMv7M.S" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/RTT/SEGGER_RTT_printf.c" projectpath="rtt/RTT"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_GCC.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_IAR.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_KEIL.c" projectpath="rtt/Syscalls"/>
        <file category="sourceC" name="components/rtt/Syscalls/SEGGER_RTT_Syscalls_SES.c" projectpath="rtt/Syscalls"/>
        <file category="doc" name="components/rtt/License.txt" projectpath="rtt"/>
        <file category="doc" name="components/rtt/README.txt" projectpath="rtt"/>
        <file category="include" name="components/rtt/RTT/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template" Cversion="7.22.0" condition="driver.rtt.template.condition_id">
      <description>RTT template configuration</description>
      <files>
        <file category="header" attr="config" name="components/rtt/template/SEGGER_RTT_Conf.h" version="7.22.0" projectpath="rtt/template"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sar_adc" Cversion="2.3.0" condition="driver.sar_adc.condition_id">
      <description>SAR_ADC Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_sar_adc.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE31B/drivers/fsl_sar_adc.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="Siul2" Cversion="2.1.0" condition="driver.siul2.condition_id">
      <description>Siul2 Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_siul2.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE31B/drivers/fsl_siul2.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ssd1963" Cversion="1.2.0" condition="driver.ssd1963.condition_id">
      <description>Driver ssd1963</description>
      <files>
        <file category="header" name="components/display/ssd1963/fsl_ssd1963.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/ssd1963/fsl_ssd1963.c" projectpath="lcdc"/>
        <file category="include" name="components/display/ssd1963/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="st7796s" Cversion="1.0.0" condition="driver.st7796s.condition_id">
      <description>Driver st7796s</description>
      <files>
        <file category="header" name="components/display/st7796s/fsl_st7796s.h" projectpath="lcdc"/>
        <file category="sourceC" name="components/display/st7796s/fsl_st7796s.c" projectpath="lcdc"/>
        <file category="include" name="components/display/st7796s/"/>
      </files>
    </component>
