vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXE31B_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="stm" Cversion="2.0.1" condition="driver.stm.condition_id">
      <description>stm Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_stm.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE31B/drivers/fsl_stm.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="swt" Cversion="2.1.1" condition="driver.swt.condition_id">
      <description>swt Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_swt.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE31B/drivers/fsl_swt.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tempsense" Cversion="2.0.0" condition="driver.tempsense.condition_id">
      <description>tempsense Driver</description>
      <files>
        <file category="header" name="devices/MCXE31B/drivers/fsl_tempsense.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_tempsense.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tma525b" Cversion="1.0.0" condition="driver.tma525b.condition_id">
      <description>Driver tma525b</description>
      <files>
        <file category="header" name="components/touch/tma525b/fsl_tma525b.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/tma525b/fsl_tma525b.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/tma525b/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="trgmux" Cversion="2.0.1" condition="driver.trgmux.condition_id">
      <description>TRGMUX Driver</description>
      <files>
        <file category="header" name="devices/MCXE31B/drivers/fsl_trgmux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_trgmux.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tsl2561" Cversion="1.0.0" condition="driver.tsl2561.condition_id">
      <description>Driver tsl2561</description>
      <files>
        <file category="header" name="components/sensor/tsl2561/fsl_tsl2561.h" projectpath="tsl"/>
        <file category="sourceC" name="components/sensor/tsl2561/fsl_tsl2561.c" projectpath="tsl"/>
        <file category="include" name="components/sensor/tsl2561/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="tspc" Cversion="2.0.0" condition="driver.tspc.condition_id">
      <description>the Touch Sensing Pin Coupling Driver</description>
      <files>
        <file category="header" name="devices/MCXE31B/drivers/fsl_tspc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_tspc.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-common" Cversion="1.1.0" condition="driver.video-common.condition_id">
      <description>Driver video-common</description>
      <files>
        <file category="header" name="components/video/fsl_video_common.h" projectpath="video"/>
        <file category="sourceC" name="components/video/fsl_video_common.c" projectpath="video"/>
        <file category="include" name="components/video/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="video-i2c" Cversion="1.0.1" condition="driver.video-i2c.condition_id">
      <description>Driver video-i2c</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/video/i2c/fsl_video_i2c.h" projectpath="video"/>
        <file category="sourceC" name="components/video/i2c/fsl_video_i2c.c" projectpath="video"/>
        <file category="include" name="components/video/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="virt_wrapper" Cversion="2.0.0" condition="driver.virt_wrapper.condition_id">
      <description>VIRT_WRAPPER Driver</description>
      <files>
        <file category="header" name="devices/MCXE31B/drivers/fsl_virt_wrapper.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_virt_wrapper.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="wkpu" Cversion="2.0.0" condition="driver.wkpu.condition_id">
      <description>Wakeup Unit Driver</description>
      <files>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_wkpu.c" projectpath="drivers"/>
        <file category="header" name="devices/MCXE31B/drivers/fsl_wkpu.h" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="xbic" Cversion="2.0.1" condition="driver.xbic.condition_id">
      <description>xbic Driver</description>
      <files>
        <file category="header" name="devices/MCXE31B/drivers/fsl_xbic.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MCXE31B/drivers/fsl_xbic.c" projectpath="drivers"/>
        <file category="include" name="devices/MCXE31B/drivers/"/>
      </files>
    </component>
